# 1. PANDAS BASICS

In [ ]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [2]:
import pandas as pd
import numpy as np

In [2]:
# Let's define two lists as shown below:

my_list = ['AAPL', 'AMZN', 'T']
my_list

['AAPL', 'AMZN', 'T']

In [3]:
label = ['stock#1', 'stock#2', 'stock#3']
label

['stock#1', 'stock#2', 'stock#3']

In [4]:
type(label)

list

In [5]:
type(my_list)

list

In [6]:
# Let's create a one dimensional Pandas "series" 
# Note that series is formed of data and associated labels 
x_series = pd.Series(data=my_list, index=label)

In [7]:
# Let's view the series
x_series

stock#1    AAPL
stock#2    AMZN
stock#3       T
dtype: object

In [8]:
# Let's obtain the datatype
type(x_series)

pandas.core.series.Series

In [9]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df = pd.DataFrame({'Bank Client ID': [111, 222, 333, 444],
                               'Bank Client Name': ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Year with Bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
2             333            Mitch          10000               9
3             444             Ryan           2000               5

In [10]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [11]:
# you can only view the first couple of rows using .head()
bank_client_df.head(2)

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4

In [12]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail(2)

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
2             333            Mitch          10000               9
3             444             Ryan           2000               5

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [13]:
portfolio_df = pd.DataFrame({'Stock Ticker': ['AAPL', 'TSLA', 'INTC'],
                             'Number of shares': [1000, 2000, 3000],
                             'Price per share': [126.65, 695.00, 47.46]})
portfolio_df

  Stock Ticker  Number of shares  Price per share
0         AAPL              1000           126.65
1         TSLA              2000           695.00
2         INTC              3000            47.46

In [14]:
portfolio_df['Total value per ticker'] = portfolio_df['Number of shares'] * portfolio_df['Price per share']

In [15]:
portfolio_df

  Stock Ticker  Number of shares  Price per share  Total value per ticker
0         AAPL              1000           126.65                126650.0
1         TSLA              2000           695.00               1390000.0
2         INTC              3000            47.46                142380.0

In [17]:
portfolio_df['All Stocks'] = portfolio_df['Total value per ticker'].sum()

In [18]:
portfolio_df

  Stock Ticker  Number of shares  ...  Total value per ticker  All Stocks
0         AAPL              1000  ...                126650.0   1659030.0
1         TSLA              2000  ...               1390000.0   1659030.0
2         INTC              3000  ...                142380.0   1659030.0

[3 rows x 5 columns]

# 2. PANDAS WITH CSV AND HTML DATA

In [ ]:
# In order to access data on Google Drive, you need to mount the drive to access it's content
from google.colab import drive
drive.mount('/content/bank_client_information.csv')

In [6]:
data = pd.read_csv('/content/bank_client_information.csv')

In [8]:
data

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [9]:
# Pandas is used to read a csv file and store data in a DataFrame
bank_df = pd.read_csv('/content/bank_client_information.csv')

In [11]:
bank_df

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [13]:
# write to a csv file without an index
bank_df.to_csv('sample_output.csv', index=False)

In [14]:
sample_df = pd.read_csv('sample_output.csv')
sample_df

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [15]:
# write to a csv file with an index
bank_df.to_csv('sample2_output.csv', index=True)

In [16]:
sample2_df = pd.read_csv('sample2_output.csv')
sample2_df

   Unnamed: 0 First Name Last Name              Email Postal Code   Net Worth
0           0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1           1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2           2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [17]:
# Read tabular data using read_html
house_prices_df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')

In [18]:
house_prices_df

[                                                City  ...                                    12 Month Change
 0                                      Vancouver, BC  ...                                           + 2.63 %
 1                                       Toronto, Ont  ...                                            +10.2 %
 2                                        Ottawa, Ont  ...                                           + 15.4 %
 3                                       Calgary, Alb  ...                                            – 1.5 %
 4                                      Montreal, Que  ...                                            + 9.3 %
 5                                        Halifax, NS  ...                                            + 3.6 %
 6                                       Regina, Sask  ...                                            – 3.9 %
 7                                    Fredericton, NB  ...                                            – 4.3 %
 8  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

 [9 rows x 3 columns],
                                              Province  ...                                    12 Month Change
 0                                    British Columbia  ...                                            + 7.6 %
 1                                             Ontario  ...                                            – 3.2 %
 2                                             Alberta  ...                                            – 7.5 %
 3                                              Quebec  ...                                            + 7.6 %
 4                                            Manitoba  ...                                            – 1.4 %
 5                                        Saskatchewan  ...                                            – 3.8 %
 6                                         Nova Scotia  ...                                            + 3.5 %
 7                                Prince Edward Island  ...                                            + 3.0 %
 8                             Newfoundland / Labrador  ...                                            – 1.6 %
 9                                       New Brunswick  ...                                            – 2.2 %
 10                                   Canadian Average  ...                                            – 1.3 %
 11  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

 [12 rows x 3 columns]]

In [19]:
house_prices_df[0]

                                                City  ...                                    12 Month Change
0                                      Vancouver, BC  ...                                           + 2.63 %
1                                       Toronto, Ont  ...                                            +10.2 %
2                                        Ottawa, Ont  ...                                           + 15.4 %
3                                       Calgary, Alb  ...                                            – 1.5 %
4                                      Montreal, Que  ...                                            + 9.3 %
5                                        Halifax, NS  ...                                            + 3.6 %
6                                       Regina, Sask  ...                                            – 3.9 %
7                                    Fredericton, NB  ...                                            – 4.3 %
8  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

[9 rows x 3 columns]

In [20]:
house_prices_df[1]

                                             Province  ...                                    12 Month Change
0                                    British Columbia  ...                                            + 7.6 %
1                                             Ontario  ...                                            – 3.2 %
2                                             Alberta  ...                                            – 7.5 %
3                                              Quebec  ...                                            + 7.6 %
4                                            Manitoba  ...                                            – 1.4 %
5                                        Saskatchewan  ...                                            – 3.8 %
6                                         Nova Scotia  ...                                            + 3.5 %
7                                Prince Edward Island  ...                                            + 3.0 %
8                             Newfoundland / Labrador  ...                                            – 1.6 %
9                                       New Brunswick  ...                                            – 2.2 %
10                                   Canadian Average  ...                                            – 1.3 %
11  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

[12 rows x 3 columns]

**MINI CHALLENGE #2:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [21]:
retirement_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_df

[                                        Year of birth                                                Age
 0                                      1937 and prior                                                 65
 1                                                1938                                    65 and 2 months
 2                                                1939                                    65 and 4 months
 3                                                1940                                    65 and 6 months
 4                                                1941                                    65 and 8 months
 5                                                1942                                   65 and 10 months
 6                                             1943-54                                                 66
 7                                                1955                                    66 and 2 months
 8                                                1956                                    66 and 4 months
 9                                                1957                                    66 and 6 months
 10                                               1958                                    66 and 8 months
 11                                               1959                                   66 and 10 months
 12                                     1960 and later                                                 67
 13  Notes: 1. Persons born on January 1 of any yea...  Notes: 1. Persons born on January 1 of any yea...]

# 3. PANDAS OPERATIONS

In [22]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank Client ID': [111, 222, 333, 444],
                               'Bank Client Name': ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Year with Bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
2             333            Mitch          10000               9
3             444             Ryan           2000               5

In [25]:
# Pick certain rows that satisfy a certain criteria 
df_loyal = bank_client_df[ (bank_client_df['Year with Bank'] >= 5) ] 
df_loyal

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
2             333            Mitch          10000               9
3             444             Ryan           2000               5

In [26]:
# Delete a column from a DataFrame
del bank_client_df['Bank Client ID']
bank_client_df

  Bank Client Name  Net Worth [$]  Year with Bank
0           Chanel           3500               3
1            Steve          29000               4
2            Mitch          10000               9
3             Ryan           2000               5

**MINI CHALLENGE #3:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [27]:
high_networth_df = bank_client_df[ (bank_client_df['Net Worth [$]'] >= 5000) ]
high_networth_df

  Bank Client Name  Net Worth [$]  Year with Bank
1            Steve          29000               4
2            Mitch          10000               9

In [29]:
combined_networth = high_networth_df['Net Worth [$]'].sum()
combined_networth

39000

# 4. PANDAS WITH FUNCTIONS

In [30]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank Client ID': [111, 222, 333, 444],
                               'Bank Client Name': ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Year with Bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
2             333            Mitch          10000               9
3             444             Ryan           2000               5

In [33]:
# Define a function that increases all clients networth (stocks) by a fixed value of 10% (for simplicity sake) 
def networth_update(balance):
  return balance * 1.1

In [34]:
# You can apply a function to the DataFrame 
bank_client_df['Net Worth [$]'].apply(networth_update)

0     3850.0
1    31900.0
2    11000.0
3     2200.0
Name: Net Worth [$], dtype: float64

In [35]:
bank_client_df['Bank Client Name'].apply(len)

0    6
1    5
2    5
3    4
Name: Bank Client Name, dtype: int64

In [37]:
bank_client_df['Year with Bank'].sum()

21

**MINI CHALLENGE #4:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [39]:
portfolio_df = pd.DataFrame({'Stock Ticker': ['AAPL', 'TSLA', 'INTC'],
                             'Number of shares': [1000, 2000, 3000],
                             'Price per share': [126.65, 695.00, 47.46]})
portfolio_df

  Stock Ticker  Number of shares  Price per share
0         AAPL              1000           126.65
1         TSLA              2000           695.00
2         INTC              3000            47.46

In [44]:
def double_stock_price(price_per_share):
  # return np.square(price_per_share) + 100
  return price_per_share * 2 + 100

In [45]:
portfolio_df['Double Stock Prices'] = portfolio_df['Price per share'].apply(double_stock_price)

In [46]:
portfolio_df

  Stock Ticker  Number of shares  Price per share  Double Stock Prices
0         AAPL              1000           126.65               353.30
1         TSLA              2000           695.00              1490.00
2         INTC              3000            47.46               194.92

In [47]:
total_networth_all_clients = portfolio_df['Double Stock Prices'].sum()
total_networth_all_clients

2038.22

# 5. SORTING AND ORDERING

In [48]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank Client ID': [111, 222, 333, 444],
                               'Bank Client Name': ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Year with Bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
2             333            Mitch          10000               9
3             444             Ryan           2000               5

In [49]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values('Year with Bank')

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
3             444             Ryan           2000               5
2             333            Mitch          10000               9

In [50]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
2             333            Mitch          10000               9
3             444             Ryan           2000               5

In [51]:
# Set inplace = True to ensure that change has taken place in memory 
bank_client_df.sort_values(by=['Year with Bank'], inplace=True)

In [52]:
# Note that now the change (ordering) took place 
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
0             111           Chanel           3500               3
1             222            Steve          29000               4
3             444             Ryan           2000               5
2             333            Mitch          10000               9

**MINI CHALLENGE #5:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [53]:
bank_client_df.sort_values(by=['Net Worth [$]'], inplace=True)

In [54]:
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Year with Bank
3             444             Ryan           2000               5
0             111           Chanel           3500               3
2             333            Mitch          10000               9
1             222            Steve          29000               4

# 6. CONCATENATING AND MERGING WITH PANDAS

Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [4]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [5]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

In [8]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [58]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5 

raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5'],
            'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'],
            'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}
raw_data

{'Bank Client ID': ['1', '2', '3', '4', '5'],
 'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'],
 'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}

In [59]:
bank_df_1 = pd.DataFrame(raw_data, columns=['Bank Client ID', 'First Name', 'Last Name'])
bank_df_1

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [60]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data_2 = {'Bank Client ID': ['6', '7', '8', '9', '10'],
            'First Name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'],
            'Last Name': ['Novak', 'Mo', 'Larsen', 'Iron', 'Sailer']}
raw_data_2

{'Bank Client ID': ['6', '7', '8', '9', '10'],
 'First Name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'],
 'Last Name': ['Novak', 'Mo', 'Larsen', 'Iron', 'Sailer']}

In [61]:
bank_df_2 = pd.DataFrame(raw_data_2, columns=['Bank Client ID', 'First Name', 'Last Name'])
bank_df_2

  Bank Client ID First Name Last Name
0              6       Bill     Novak
1              7       Dina        Mo
2              8      Sarah    Larsen
3              9    Heather      Iron
4             10      Holly    Sailer

In [62]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
salary_data = {'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
               'Annual Salary [$/y]': [25000, 35000, 45000, 50000, 55000, 65000, 70000, 75000, 85000, 95000]}

bank_df_salary = pd.DataFrame(salary_data, columns=['Bank Client ID', 'Annual Salary [$/y]'])
bank_df_salary

  Bank Client ID  Annual Salary [$/y]
0              1                25000
1              2                35000
2              3                45000
3              4                50000
4              5                55000
5              6                65000
6              7                70000
7              8                75000
8              9                85000
9             10                95000

In [63]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
bank_df_all = pd.concat([bank_df_1, bank_df_2])
bank_df_all

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve
0              6       Bill     Novak
1              7       Dina        Mo
2              8      Sarah    Larsen
3              9    Heather      Iron
4             10      Holly    Sailer

In [64]:
# Let's merge all data on 'Bank Client ID'
bank_df_all = pd.merge(bank_df_all, bank_df_salary, on='Bank Client ID')

In [65]:
bank_df_all

  Bank Client ID First Name Last Name  Annual Salary [$/y]
0              1      Nancy       Rob                25000
1              2       Alex       Ali                35000
2              3       Shep    George                45000
3              4        Max     Mitch                50000
4              5      Allen     Steve                55000
5              6       Bill     Novak                65000
6              7       Dina        Mo                70000
7              8      Sarah    Larsen                75000
8              9    Heather      Iron                85000
9             10      Holly    Sailer                95000

**MINI CHALLENGE #6:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [66]:
my_data = {'Bank Client ID': [11],
           'First Name': ['John'],
           'Last Name': ['Snow'],
           'Annual Salary [$/y]': [120000]}
my_data

{'Annual Salary [$/y]': [120000],
 'Bank Client ID': [11],
 'First Name': ['John'],
 'Last Name': ['Snow']}

In [67]:
my_df = pd.DataFrame(my_data, columns=['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/y]'])
my_df

   Bank Client ID First Name Last Name  Annual Salary [$/y]
0              11       John      Snow               120000

In [68]:
bank_df_all = pd.concat([bank_df_all, my_df])
bank_df_all

  Bank Client ID First Name Last Name  Annual Salary [$/y]
0              1      Nancy       Rob                25000
1              2       Alex       Ali                35000
2              3       Shep    George                45000
3              4        Max     Mitch                50000
4              5      Allen     Steve                55000
5              6       Bill     Novak                65000
6              7       Dina        Mo                70000
7              8      Sarah    Larsen                75000
8              9    Heather      Iron                85000
9             10      Holly    Sailer                95000
0             11       John      Snow               120000

# EXCELLENT JOB!

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [ ]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

In [ ]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

**MINI CHALLENGE #2 SOLUTION:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [ ]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

**MINI CHALLENGE #3 SOLUTION:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [ ]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

In [ ]:
df_high_networth['Net worth [$]'].sum()

**MINI CHALLENGE #4 SOLUTION:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [ ]:
def networth_update(balance):
    return balance * 2 + 100 # assume that stock prices increased by 10%

In [ ]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

In [ ]:
results.sum()

**MINI CHALLENGE #5 SOLUTION:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [ ]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by = 'Net worth [$]', inplace = True) 
bank_client_df

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df